#+TITLE: k-NEAREST-NEIGBORS - BREAST CANCER PREDICTION
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: Case Study - Supervised lazy learner classifiers
#+STARTUP: overview hideblocks indent inlineimages
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:R :session *R* :results output :exports both :noweb yes
* TODO Intermission - Review from Thu 23-Feb-23

- Run the code from the last session so that you're caught up:
  #+begin_src R
    ## get the Wisconsin breast cancer data as data frame:
    wbcd <- read.csv(file="http://bit.ly/3khqmkp")
    ## drop the first (ID) column:
    wbcd <- wbcd[-1] 
    ## recode target class as labeled 2-level factor
    wbcd$diagnosis |> factor(c("B","M"),c("Benign","Malignant")) -> wbcd$diagnosis
    wbcd$diagnosis |>  str()
#+end_src

#+RESULTS:
:  Factor w/ 2 levels "Benign","Malignant": 1 1 1 1 1 1 1 2 1 1 ...

